import React from 'react';
import styles from '../style.module.css';

function WhatJsDoing() {
  return (
    <section className={styles['course-main']}>
        <h2>То що ж він справді може робити?</h2>
        <p>Ядро мови JavaScript складається з деякої кількості звичайних можливостей, які дають змогу робити таке:</p>
        <ul className={styles['course-list-disc']}>
            <li>Зберігати дані всередині змінних. У прикладі вище, ми, наприклад, запитували введення нового імені, яке потрібно було ввести, потім зберігали ім'я у змінній name.</li>
            <li>Операції над фрагментами текстів (відомими в програмуванні як "рядки"). У прикладі вище ми брали рядок "Player 1: " і приєднали його до значення змінної name для отримання повного тексту, наприклад: ''Player 1: Chris".</li>
            <li>Запускати код відповідно до певних подій, що відбуваються на web-сторінці. У нашому прикладі вище, ми використовували click (en-US) подія, для визначення моменту, коли кнопка була клацнута, відповідно до цього запускався код, який оновлював текст.</li>
            <li>І багато іншого!</li>
        </ul>
        <p>Ще більш захопливою є функціональність, створена поверх основної мови JavaScript. Так звані інтерфейси прикладного програмування (API) надають вам додаткові надздібності для використання у вашому коді JavaScript.</p>
        <p>API - це готові набори блоків коду, які дають змогу розробнику реалізовувати програми, які в іншому разі було б важко або неможливо реалізувати. Вони роблять те саме для програмування, що готові комплекти меблів роблять для домашнього будівництва - набагато простіше брати готові панелі та скручувати їх разом, щоб зробити книжкову полицю, ніж самому розробляти дизайн, ходити в пошуках правильної деревини, вирізати всі панелі необхідного розміру та форми, знайти відповідні гвинти, а потім зібрати їх разом, щоб зробити книжкову полицю.</p>
        <p>Вони зазвичай діляться на дві категорії.</p>
        <img src='/img/js_what_js_doing.png' className={styles['first-elem']}/>
        <p><span className={styles['fw700']}>API-інтерфейси </span>браузера вбудовані у ваш веб-браузер і можуть відображати дані з навколишнього комп'ютерного оточення або робити корисні складні речі. Наприклад:</p>
        <ul className={styles['course-list-disc']}>
            <li>API-інтерфейс DOM (Document Object Model) дає змогу вам маніпулювати HTML і CSS, створювати, видаляти і змінювати HTML, динамічно застосовувати нові стилі до вашої сторінки тощо. Кожного разу, коли ви бачите спливаюче вікно на сторінці або якийсь новий вміст, як ми бачили вище в нашому простому демо), наприклад, це DOM у дії.</li>
            <li>API геолокації витягує географічну інформацію. Так Google Maps може знайти ваше місце розташування і нанести його на карту.</li>
            <li>API Canvas і WebGL дають змогу створювати анімовані 2D і 3D-графіки. Люди роблять деякі дивовижні речі, використовуючи ці веб-технології - див. Chrome Experiments і webglsamples.</li>
            <li>Аудіо та відео API, як-от HTMLMediaElement і WebRTC, дають змогу робити справді цікаві речі з мультимедіа, як-от програвання аудіо та відео просто на веб-сторінці, або захоплення відео з веб-камери та відображення його на Чужий комп'ютер (спробуйте наш простий демонстраційний знімок, щоб зрозуміти ідею).</li>
        </ul>
        <p>За замовчуванням сторонні API-інтерфейси не вбудовані в браузер, і вам доведеться захоплювати їхній код та інформацію з будь-якого місця в Мережі.</p>
        <p>Доступно ще більше! Але поки що не загострюйте на цьому увагу. Ви не зможете створити наступний Facebook, Google Maps чи Instagram після 24 годин вивчення JavaScript - спершу потрібно вивчити основи. І саме для цього ви тут - давайте рухатися далі!</p>
    </section>
  )
}

export default WhatJsDoing;
