import React from 'react';
import styles from '../style.module.css';

function HtmlIntro() {
  return (
    <section className={styles['course-main']}> 
                <h2>Вступ до HTML</h2>
                <p>По суті, HTML доволі проста мова, що складається з елементів, які можуть бути застосовані до частин тексту, щоб надавати їм різних значень (Це абзац? Це маркований список? Це частина таблиці?), розділяти документ на логічні секції (чи є в документі шапка? три стовпчики з контентом? меню навігації?) і додавати контент на Вашу сторінку, як-от фото та відео. Цей модуль розповість вам про перші дві можливості HTML і навчить фундаментальних концепцій і синтаксису, які вам потрібно знати, щоб зрозуміти HTML.</p>
                <h2>Необхідні умови</h2>
                <p>Щоб почати вивчення цього модуля, вам не потрібні жодні знання HTML, але ви повинні мати хоча б базові навички поводження з комп'ютером і навички пасивного використання Веба (тобто просто дивлячись на нього, споживаючи контент). У вас має бути базове робоче середовище (описане в розділі Встановлення базового програмного забезпечення), а також розуміння, як створювати та керувати файлами, що детально описано в статті Робота з файлами - обидві статті є частиною нашого модуля Початок роботи з мережею.</p>
                <h2>Посібники</h2>
                <p>Цей модуль містить такі статті, які допоможуть вивчити всю основну теорію HTML і нададуть широкі можливості для перевірки деяких навичок.</p>
                <h3>Початок роботи з HTML</h3>
                <p>Охоплює базові основи HTML, щоб ви почали вивчення - ми опишемо елементи, атрибути та всі інші важливі терміни, про які ви, можливо, вже чули, а також де і як вони розташовуються в мові. Ми також покажемо структуру HTML-елемента, як влаштована типова сторінка HTML, і пояснимо інші важливі мовні особливості. По ходу ми будемо грати з HTML так, щоб вам було цікаво!</p>
                <h3>Що таке заголовок? Метадані в HTML</h3>
                <p>Заголовок HTML - це частина документа, яка не відображається в браузері під час завантаження сторінки. Він містить інформацію, таку як: сторінка title, посилання на CSS (якщо ви хочете стилізувати свій HTML за допомогою CSS), посилання на призначені для користувача значки та метадані (які являють собою дані про HTML, наприклад, хто його написав або важливі ключові слова, які описують документ).</p>
                <h3>Основи редагування тексту в HTML</h3>
                <p>Основним завданням HTML є надання тексту значення **(**також відоме, як семантика), щоб браузер знав, як його правильно відображати. У цій статті розглядається те, як використовувати HTML, щоб розбити блок тексту на структуру із заголовків і абзаців, додати акцент/значення слів, створити списки та багато іншого.</p>
                <h3>Створення гіперпосилань</h3>
                <p>Гіперпосилання дуже важливі - адже саме вони роблять інтернет інтернетом. У цій статті описано синтаксис, необхідний для створення посилань, а також описано їх найкраще застосування на практиці.</p>
                <h3>Поглиблене форматування тексту</h3>
                <p>Існує безліч інших елементів HTML для редагування тексту, про які ми вам не розповіли в статті Основи редагування тексту в HTML. Описані тут елементи менш відомі, але про них також корисно знати. Тут ви дізнаєтеся про розмітку цитат, списки опису, комп'ютерний код та інший супутній текст, нижній і верхній індекси, контактну інформацію та багато іншого.</p>
                <h3>Структура документа та веб-сайту</h3>
                <p>Крім визначення окремих частин сторінки (як-от "абзац" або "зображення"), HTML також використовується для визначення окремих зон веб-сайту (як-от "шапка", "меню навігації", "стовпчик з основним вмістом"). У цій статті розглянуто, як планувати базову структуру веб-сайту та писати HTML для представлення цієї структури.</p>
                <h3>Налагодження HTML</h3>
                <p>Писати HTML добре, але що, якщо щось іде не так, і ви не можете знайти місце помилки в коді? У цій статті ви познайомитеся з деякими інструментами, які можуть вам допомогти.</p>
    </section>
  )
}

export default HtmlIntro;
