import React from 'react';
import styles from '../style.module.css';

function CssIntro() {
  return (
    <section className={styles['course-main']}>
      <h2>Основи CSS</h2>
      <p>CSS (Cascading Style Sheets) - це код, який ви використовуєте для стилізації вашої веб-сторінки. Основи CSS допоможуть вам зрозуміти, що вам потрібно для початку роботи. Ми відповімо на такі запитання як: Як зробити мій текст чорним або червоним? Як зробити так, щоб контент з'являвся в певному місці на екрані? Як прикрасити мою веб-сторінку за допомогою фонових зображень і кольорів?</p>
      <h2>Так що ж таке CSS?</h2>
      <p>Як і HTML, CSS насправді не є мовою програмування. Це не мова розмітки - це мова таблиці стилів. Це означає, що вона дає змогу застосовувати стилі вибірково до елементів у документах HTML. Наприклад, щоб вибрати всі елементи абзацу на HTML-сторінці та змінити текст усередині них із чорного на червоний, ви маєте написати цей CSS:</p>
      <p>Але нам все одно потрібно застосувати CSS до нашого HTML-документа. В іншому разі, CSS стиль не вплине на те, як ваш браузер відобразить HTML документ. (Якщо ви не стежили за нашим проектом, то прочитайте розділ Робота з файлами та Основи HTML, щоб дізнатися, що вам потрібно зробити насамперед.)</p>

      <div className={styles.blockStyle}>
        <span>{`p { `}</span>
        <span>{`color: red;`}</span>
        <span>{ `}`}</span>
      </div>
      <p>Давайте спробуємо: вставте ці три рядки CSS у новий файл у ваш текстовий редактор, а потім збережіть файл як style.css у вашій папці styles.</p>
      <p>Але нам все одно потрібно застосувати CSS до нашого HTML-документа. В іншому разі, CSS стиль не вплине на те, як ваш браузер відобразить HTML документ. (Якщо ви не стежили за нашим проектом, то прочитайте розділ Робота з файлами та Основи HTML, щоб дізнатися, що вам потрібно зробити насамперед.)</p>
      <ul className={styles['course-list']}>
            <li>Відкрийте ваш файл index.html і вставте наступний рядок куди-небудь у шапку, між {`<head> і </head>`} тегами:
            <div className={styles['blockStyle']}>{`<link href="styles/style.css" rel="stylesheet" type="text/css">
`}</div></li>
            <li>Збережіть index.html і завантажте його у вашому браузері. Ви маєте побачити щось на кшталт цього:</li>
        </ul>
        <img className={styles['first-elem']} src='/img/mozila.png'/>
        <p>Якщо текст вашого абзацу тепер червоний, прийміть наші вітання! Ви написали свій перший успішний CSS!</p>
        <h4>Анатомія набору правил CSS</h4>
        <p>Давайте поглянемо на вищезгаданий CSS трохи детальніше:</p>
        <img src='/img/css-rules.png' className={styles['first-elem']}/>
        <p>Уся структура називається набором правил (але найчастіше для стислості "правило"). Зазначимо також імена окремих частин:</p>
        <p><span className={styles['fw700']}>Селектор (Selector)</span></p>
        <p>Ім'я HTML-елемента на початку набору правил. Він обирає елемент(и) для застосування стилю (у цьому випадку, елементи p ). Для стилізації іншого елемента, просто змініть селектор.</p>
        <p><span className={styles['fw700']}>Оголошення (Declaration)</span></p>
        <p>Єдине правило, наприклад color: red; вказує, які з властивостей елемента ви хочете стилізувати.</p>
        <p><span className={styles['fw700']}>Властивості (Properties)</span></p>
        <p>Способи, якими ви можете стилізувати певний HTML-елемент (у цьому випадку, color є властивістю для елементів {`<p>`}). У CSS ви вибираєте, яких властивостей ви хочете торкнутися у вашому правилі.</p>
        <p><span className={styles['fw700']}>Значення властивості (Property value)</span></p>
        <p>Праворуч від властивості, після двокрапки, у нас є значення властивості, яке обирає одну з безлічі можливих ознак для цієї властивості (існує безліч значень color, крім red).</p>
        <p>Зверніть увагу на важливі частини синтаксису:</p>
        <ul className={styles['course-list-disc']}>
          <li>Кожен набір правил (крім селектора) має бути обгорнутий у фігурні дужки ({`{}`}).</li>
          <li>У кожному оголошенні необхідно використовувати двокрапку (:), щоб відокремити властивість від її значень.</li>
          <li>У кожному наборі правил ви повинні використовувати крапку з комою (;), щоб відокремити кожне оголошення від наступного.</li>
        </ul>
        <p>Таким чином, щоб змінити кілька значень властивостей одразу, вам просто потрібно написати їх, розділяючи крапкою з комою, наприклад так:</p>
        <div className={styles['blockStyle']}>
          <span>{`p {`}</span>
          <span className={styles['padding-left-20px']}>{`color: red;`}</span>
          <span className={styles['padding-left-20px']}>{`width: 500px;`}</span>
          <span className={styles['padding-left-20px']}>{`border: 1px solid black;`}</span>
          <span>{`}`}</span>
        </div>
        <h4>Вибір декількох елементів</h4>
        <p>Ви також можете вибрати кілька елементів різного типу і застосувати єдиний набір правил для всіх із них. Додайте кілька селекторів, розділених комами. Наприклад:</p>
        <div className={styles['blockStyle']}>
          <span>{`p,li,h1 {`}</span>
          <span className={styles['padding-left-20px']}>{`color: red;`}</span>
          <span>{`}`}</span>
        </div>
        
    </section>
  )
}

export default CssIntro;