import React from 'react';
import styles from '../style.module.css';

function CssBlocks() {
  return (
    <section className={styles['course-main']}>
        <h2>Блоки, блоки і ще раз блоки</h2>
        <p>Одна річ, яку ви помітите в написанні CSS, полягає в тому, що багато чого з цього стосується блоків - налаштування їхнього розміру, кольору, положення тощо. Більшість HTML-елементів на сторінці можна розглядати як блоки, розташовані один над одним.</p>
        <img src='/img/css_blocks.jpg' className={styles['first-elem']}/>
        <p>Одна річ, яку ви помітите в написанні CSS, полягає в тому, що багато чого з цього стосується блоків - налаштування їхнього розміру, кольору, положення тощо. Більшість HTML-елементів на сторінці можна розглядати як блоки, розташовані один над одним.</p>
        <ul className={styles['course-list-disc']}>
            <li><span className={styles['fw700']}>padding</span>, простір тільки навколо контенту (наприклад, навколо абзацу тексту)</li>
            <li><span className={styles['fw700']}>border</span>, суцільна лінія, яка розташована поруч із padding</li>
            <li><span className={styles['fw700']}>margin</span>, простір навколо зовнішньої сторони елемента</li>
            <img src='/img/css_padding_margin_border.png' className={styles['first-elem']}/>
        </ul>
        <p>У цьому розділі ми також використовуємо:</p>
        <ul className={styles['course-list-disc']}>
            <li><span className={styles['fw700']}>width</span>(ширину елемента)</li>
            <li><span className={styles['fw700']}>background-color</span>, колір позаду контенту і padding елементів</li>
            <li><span className={styles['fw700']}>color</span>, колір контенту елемента (зазвичай тексту)</li>
            <li><span className={styles['fw700']}>text-shadow</span>: встановлює тінь на тексті всередині елемента</li>
            <li><span className={styles['fw700']}>display</span>: встановлює режим відображення елемента (поки що не хвилюйтеся про це)</li>
        </ul>
        <p>Отже, давайте почнемо і додамо більше CSS на нашій сторінці! Продовжуйте додавати ці нові правила, розташовані в нижній частині сторінки, і не бійтеся експериментувати зі зміною значень, щоб побачити, як це працює.</p>
        <h2>Зміна кольору сторінки</h2>
        <div className={styles['blockStyle']}>
            <span>{`html {`}</span>
            <span className={styles['padding-left-20px']}>{`background-color: #00539F;`}</span>
            <span>{`}`}</span>
        </div>
        <h2>Розбираємося з тілом</h2>
        <div className={styles['blockStyle']}>
            <span>{`body {`}</span>
            <span className={styles['padding-left-20px']}>{`width: 600px;`}</span>
            <span className={styles['padding-left-20px']}>{`margin: 0 auto;`}</span>
            <span className={styles['padding-left-20px']}>{`background-color: #FF9500;`}</span>
            <span className={styles['padding-left-20px']}>{`padding: 0 20px 20px 20px;`}</span>
            <span className={styles['padding-left-20px']}>{`border: 5px solid black;`}</span>
            <span>{`}`}</span>
        </div>
        <p>{`Тепер для <body> елемента. Тут є чимало декларацій, тож давайте пройдемо через них усіх по одному:`}</p>
        <ul className={styles['course-list-disc']}>
            <li><span className={styles['fw700']}>width: 600px; </span>- змушує тіло бути завжди 600 пікселів завширшки.</li>
            <li><span className={styles['fw700']}>margin: 0 auto; </span>- коли ви встановлюєте два значення для таких властивостей, як margin або padding, перше значення елемента впливає на верхню й нижню сторону (робить їх 0 у цьому разі), і друге значення на ліву й праву сторону (тут auto є особливим значенням, що ділить доступний простір за горизонталлю порівну ліворуч і праворуч). Ви також можете використовувати один, три або чотири значення, як описано тут.</li>
            <li><span className={styles['fw700']}>background-color: #FF9500; </span>- як і раніше, встановлює колір фону елемента. Я використовував червонувато-помаранчевий для тіла, на відміну від темно-синього кольору для {`<html>`} елемента, але не соромтеся й експериментуйте.</li>
            <li><span className={styles['fw700']}>padding: 0 20px 20px 20px;</span>- у нас є чотири значення, встановлені для padding, щоб зробити трохи простору навколо нашого контенту. Цього разу ми не встановлюємо padding на верхній частині тіла, але робимо 20 пікселів зліва, знизу і справа. Значення встановлюються зверху, справа, знизу, зліва, у такому порядку.</li>
            <li><span className={styles['fw700']}>border: 5px solid black;</span>- просто встановлює суцільну чорну рамку шириною 5 пікселів з усіх боків тіла.</li>
        </ul>
        <h2>Позиціонування і стилізація нашого заголовка головної сторінки</h2>
        <div className={styles['blockStyle']}>
            <span>{`h1 {`}</span>
            <span className={styles['padding-left-20px']}>{`margin: 0;`}</span>
            <span className={styles['padding-left-20px']}>{`padding: 20px 0;`}</span>
            <span className={styles['padding-left-20px']}>{`color: #00539F;`}</span>
            <span className={styles['padding-left-20px']}>{`text-shadow: 3px 3px 1px black;`}</span>
            <span>{`}`}</span>
        </div>
        <p>{`Ви, можливо, помітили, що є жахливий розрив у верхній частині тіла. Це відбувається, тому що браузери застосовують певний стиль за замовчуванням для елемента <h1> (en-US) (порівняно з іншими), навіть якщо ви не застосовували будь-який CSS взагалі! Це може звучати як погана ідея, але ми хочемо, щоб веб-сторінка без стилів мала базову читабельність. Щоб позбутися розриву, ми перевизначили стиль за замовчуванням, встановивши margin: 0;.`}</p>
        <p>Потім ми встановили заголовку верхній і нижній padding на 20 пікселів, і зробили текст заголовка такого самого кольору, як і колір фону html.</p>
        <p>Тут ми використовували одну досить цікаву властивість - це text-shadow, яка застосовує тінь до текстового контенту елемента. Вона має такі чотири значення:</p>
        <ul className={styles['course-list-disc']}>
            <li>Перше значення пікселів задає <span className={styles['fw700']}>горизонтальний зсув</span> тіні від тексту - як далеко вона рухається впоперек: від'ємне значення має рухати її вліво.</li>
            <li>Друге значення пікселів задає <span className={styles['fw700']}>вертикальний зсув </span>тіні від тексту - як далеко вона рухається донизу, у цьому прикладі: від'ємне значення повинно перемістити її вгору.</li>
            <li>Третє значення пікселів задає <span className={styles['fw700']}>радіус розмиття </span>тіні - більше значення означатиме більш розмиту тінь.</li>
            <li>Четверте значення задає основний колір тіні.</li>
        </ul>
        <p>І знову спробуйте поекспериментувати з різними значеннями, щоб подивитися, що ви можете придумати.</p>
        <h2>Центрування зображення</h2>
        <div className={styles['blockStyle']}>
            <span>{`img {`}</span>
            <span className={styles['padding-left-20px']}>{`display: block;`}</span>
            <span className={styles['padding-left-20px']}>{`margin: 0 auto;`}</span>
            <span>{`}`}</span>
        </div>
        <p>Насамкінець, ми відцентруємо зображення, щоб воно мало кращий вигляд. Ми можемо використовувати margin: 0 auto прийом знову, як ми це робили раніше для body, але ми також повинні зробити дещо ще. Елемент {`<body>`} є <span className={styles['fw700']}>блоковим,</span> це означає, що він займає всю ширину сторінки і може мати margin та інші значення відступів, що застосовуються до нього. Зображення, навпаки, є <span className={styles['fw700']}>рядковими елементами,</span> тобто вони цього не можуть. Таким чином, щоб застосувати margin до зображення, ми повинні дати зображенню блокову поведінку за допомогою display: block;.</p>
        <div className={styles['notes']}><span className={styles['fw700']}>Примітка: </span>Наведені вище інструкції припускають, що ви використовуєте зображення меншої ширини, ніж задане для {`<body> (600px). Якщо ваше зображення більше, воно вийде за межі <body> і займе простір сторінки. Щоб виправити це, ви можете: 1) зменшити ширину зображення за допомогою графічного редактора, або 2) змінити розмір зображення за допомогою CSS шляхом встановлення властивості width для <img> менше, ніж у <body>.`}
        </div>
        <div className={styles['notes']}><span className={styles['fw700']}>Примітка: </span>Не варто турбуватися, якщо ви ще не розумієте display: block; і відмінності між блоковим/рядковим. Ви зрозумієте, коли вивчатимете CSS детальніше.</div>
    </section>
  )
}

export default CssBlocks;
